# GenerateNewSplitTopoFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SplitToposolidFailures..::..GenerateNewSplitTopoFailed Property
BuiltInFailures..::..SplitToposolidFailures Class See Also
---
Failed to generate new toposolid after split.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GenerateNewSplitTopoFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GenerateNewSplitTopoFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GenerateNewSplitTopoFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SplitToposolidFailures Class
Autodesk.Revit.DB Namespace